Write a python program to display all the header tags from ‘en.wikipedia.org/wiki/Main_Page’.

In [5]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import re

### scraping all the header tags from ‘en.wikipedia.org/wiki/Main_Page’.

In [6]:
page=requests.get("https://en.wikipedia.org/wiki/Main_Page")

In [7]:
page

In [8]:
wiki=BeautifulSoup(page.content)

In [9]:
headers=wiki.find_all('h1')
headers

In [10]:
wiki.select('h3')[4].text

'\nMore\nexpanded\ncollapsed\n'

In [11]:
headers=wiki.find_all(['h1', 'h2','h3','h4','h5','h6'])

In [12]:
headers_text=[]
for i in headers:
    headers_text.append(i.text.strip().replace("\n"," "))
headers_text

['Main Page',
 "From today's featured article",
 'Did you know\xa0...',
 'In the news',
 'On this day',
 "Today's featured picture",
 'Other areas of Wikipedia',
 "Wikipedia's sister projects",
 'Wikipedia languages',
 'Navigation menu',
 'Personal tools',
 'Namespaces',
 'Variants expanded collapsed',
 'Views',
 'More expanded collapsed',
 'Search',
 'Navigation',
 'Contribute',
 'Tools',
 'Print/export',
 'In other projects',
 'Languages']

In [13]:
df_wiki=pd.DataFrame({})
df_wiki['headers']=headers_text

In [14]:
df_wiki

                          headers
0                       Main Page
1   From today's featured article
2                Did you know ...
3                     In the news
4                     On this day
5        Today's featured picture
6        Other areas of Wikipedia
7     Wikipedia's sister projects
8             Wikipedia languages
9                 Navigation menu
10                 Personal tools
11                     Namespaces
12    Variants expanded collapsed
13                          Views
14        More expanded collapsed
15                         Search
16                     Navigation
17                     Contribute
18                          Tools
19                   Print/export
20              In other projects
21                      Languages

### scraping IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release)

https://www.imdb.com/chart/top/?sort=ir,desc&mode=simple&page=1

In [15]:
imdb=requests.get("https://www.imdb.com/chart/top/?sort=ir,desc&mode=simple&page=1")

In [16]:
imdb

In [17]:
imdbSoup=BeautifulSoup(imdb.content)

In [18]:
titleColumns=imdbSoup.find_all('td',class_='titleColumn')
titleColumns=titleColumns[0:100]

In [19]:
titleColumns[0].select('a')[0].text

'The Shawshank Redemption'

In [20]:
title_Columns_list=[]
for title in titleColumns:
    title_Columns_list.append(title.select("a")[0].text)
ratingColumns=imdbSoup.find_all('td',class_='ratingColumn imdbRating')
ratingColumns=ratingColumns[0:100]
rating_list=[]
for rating in ratingColumns:
    rating_list.append(rating.select('strong')[0].text)
yearColumns=imdbSoup.find_all('span',class_='secondaryInfo')
yearColumns=yearColumns[0:100]
year_list=[]
for spanc in yearColumns:
    year_list.append(re.sub(r"[^a-zA-Z0-9]","",spanc.text))

In [21]:
type(ratingColumns[0])

bs4.element.Tag

In [22]:
ratingColumns[0]

<td class="ratingColumn imdbRating">
<strong title="9.2 based on 2,464,913 user ratings">9.2</strong>
</td>

In [23]:
ratingColumns[0].select('strong')[0].text

'9.2'

In [24]:
len(rating_list)

100

In [25]:
yearColumns[0]

In [26]:
yearColumns[0].text.strip('(')

'1994)'

In [27]:
string = yearColumns[0].text

new_string = ''.join(char for char in string if char.isalnum())
print(new_string)

1994

In [28]:

string = yearColumns[0].text
new_string = re.sub(r"[^a-zA-Z0-9]","",string)
print(new_string)

1994

In [29]:
imdb_Top_100=pd.DataFrame({})
imdb_Top_100['title']=title_Columns_list
imdb_Top_100['rating']=rating_list
imdb_Top_100['year']=year_list


imdb_Top_100

                                    title rating  year
0                The Shawshank Redemption    9.2  1994
1                           The Godfather    9.1  1972
2                  The Godfather: Part II    9.0  1974
3                         The Dark Knight    9.0  2008
4                            12 Angry Men    8.9  1957
..                                    ...    ...   ...
95                                 Jagten    8.3  2012
96                    Requiem for a Dream    8.3  2000
97                    Singin' in the Rain    8.3  1952
98                     North by Northwest    8.3  1959
99  Eternal Sunshine of the Spotless Mind    8.3  2004

[100 rows x 3 columns]

## IMDB’s Top rated 100 Indian movies’ data (i.e. Name, IMDB rating, Year of release).

https://www.imdb.com/india/top-rated-indian-movies/

In [30]:
imdbIndian=requests.get("https://www.imdb.com/india/top-rated-indian-movies/")

In [31]:
imdbIndian

In [32]:
imdbIndianSoup=BeautifulSoup(imdbIndian.content)

In [33]:
titleIndColumns=imdbIndianSoup.find_all('td',class_='titleColumn')
titleIndColumns=titleIndColumns[0:100]
titleInd_Columns_list=[]
ratingInd_list=[]

yearIndColumns=imdbIndianSoup.find_all('span',class_='secondaryInfo')
yearIndColumns=yearIndColumns[0:100]

ratingIndColumns=imdbIndianSoup.find_all('td',class_='ratingColumn imdbRating')
ratingIndColumns=ratingIndColumns[0:100]
yearInd_list=[]

for title in titleIndColumns:
    titleInd_Columns_list.append(title.select("a")[0].text)
for rating in ratingIndColumns:
    ratingInd_list.append(rating.select('strong')[0].text)
for spanc in yearIndColumns:
    yearInd_list.append(re.sub(r"[^a-zA-Z0-9]","",spanc.text))

In [34]:
imdb_Top_Ind_100=pd.DataFrame({})
imdb_Top_Ind_100['title']=titleInd_Columns_list
imdb_Top_Ind_100['rating']=ratingInd_list
imdb_Top_Ind_100['year']=yearInd_list
imdb_Top_Ind_100['index']=list(range(1,101))
imdb_Top_Ind_100.set_index('index',inplace=True)


imdb_Top_Ind_100

                                   title rating  year
index
1                                Nayakan    8.5  1987
2                             Anbe Sivam    8.5  2003
3                      Pariyerum Perumal    8.5  2018
4                      C/o Kancharapalem    8.5  2018
5                                Golmaal    8.5  1979
...                                  ...    ...   ...
96                       Rang De Basanti    8.1  2006
97                       OMG: Oh My God!    8.1  2012
98                                  Roja    8.1  1992
99              Uri: The Surgical Strike    8.1  2019
100    Lagaan: Once Upon a Time in India    8.1  2001

[100 rows x 3 columns]

## scraping book name, author name, genre and book review of any 5 books from www.bookpage.com’

In [35]:
requests.get("https://bookpage.com")

In [36]:
reviewsHomePage=requests.get("https://bookpage.com/reviews")
reviewsHomeSoup=BeautifulSoup(reviewsHomePage.content)

In [37]:
bookNamesList=[]
bookNames=reviewsHomeSoup.find_all('h4',class_='italic')
bookNames=bookNames[0:5]
for bookName in bookNames:
    bookNamesList.append(bookName.text.replace("\n",""))

authorNamesList=[]
authorNames=reviewsHomeSoup.find_all('p',class_='sans bold')
authorNames=authorNames[0:5]
for authorName in authorNames:
    authorNamesList.append(authorName.text.replace("\n",""))

genreList=[]
genres=reviewsHomeSoup.find_all('p',class_='genre-links hidden-phone')
genres=genres[0:5]
for genre in genres:
    genreList.append(genre.text.replace("\n",""))

In [38]:
review_classes=reviewsHomeSoup.find_all('div',class_='read-full')
review_classes=review_classes[0:5]

In [39]:
review_classes[0].select('a')[0]['href']

'/reviews/26671-nicholas-sparks-wish-fiction'

In [40]:
firstReview=requests.get("https://bookpage.com/reviews/26652-john-lewis-carry-audio#.YUlbOLgzZEZ")

In [41]:
soup=BeautifulSoup(firstReview.text,'lxml')

In [42]:
soup.select('.article-body')[0]

<div class="article-body">
<p>
</p><p>​​You know those motivational posters that hang in your place of work? The ones with the simple messages about teamwork, friendship, success and excellence? <b>Carry On </b>(2.5 hours), the new audiobook from late, great civil rights icon Representative John Lewis, is like that—only better, because his aphorisms are punchy yet never cliched, and you can take his inspirational words with you and play them anytime you need a lift.</p>
<p>Actor Don Cheadle narrates each of Lewis’ 43 short essays with clarity and passion, knowing just where to put the right amount of emphasis. While Lewis was unable to record the audiobook himself, Cheadle more than succeeds in embodying the congressman’s message of hope.</p>
<p>Ruminating on topics that range from justice and conscience to hobbies and humor, Lewis has blessed us with a timeless collection of wisdom and knowledge from a lifetime of “good trouble” in his nonviolent quest for equality. “A good day,” Lewis tells us, “is waking up and being alive.”</p>
<p> </p>
<p><em>ALSO IN BOOKPAGE: <a href="https://bookpage.com/reviews/26412-john-lewis-carry-nonfiction#.YSz14tNKjUI">Read our review of the print edition of </a></em><a href="https://bookpage.com/reviews/26412-john-lewis-carry-nonfiction#.YSz14tNKjUI"><strong>Carry On</strong><em>.</em></a></p>
</div>

In [43]:
soup.select('.article-body')[0].find_all('p')[0].text

'\n'

In [44]:
for i in soup.select('.article-body')[0].find_all('p'):
    if i.select('a')==[]:
        print(i.text)

​​You know those motivational posters that hang in your place of work? The ones with the simple messages about teamwork, friendship, success and excellence? Carry On (2.5 hours), the new audiobook from late, great civil rights icon Representative John Lewis, is like that—only better, because his aphorisms are punchy yet never cliched, and you can take his inspirational words with you and play them anytime you need a lift.
Actor Don Cheadle narrates each of Lewis’ 43 short essays with clarity and passion, knowing just where to put the right amount of emphasis. While Lewis was unable to record the audiobook himself, Cheadle more than succeeds in embodying the congressman’s message of hope.
Ruminating on topics that range from justice and conscience to hobbies and humor, Lewis has blessed us with a timeless collection of wisdom and knowledge from a lifetime of “good trouble” in his nonviolent quest for equality. “A good day,” Lewis tells us, “is waking up and being alive.”

In [45]:
review=''
for i in soup.select('.article-body')[0].find_all('p'):
    if i.select('a')==[]:
        review+=i.text.replace("\n","")

In [46]:
reviewList=[]
home="https://bookpage.com"
for review_class in review_classes:
    review_page=home+review_class.select('a')[0]['href']
    review_HomePage=requests.get(review_page)
    reviewHomeSoup=BeautifulSoup(review_HomePage.content)
    review=''
    for i in reviewHomeSoup.select('.article-body')[0].find_all('p'):
        if i.select('a')==[]:
            review+=i.text.replace("\n","")
    reviewList.append(review)

In [47]:
bookPages=pd.DataFrame({})
bookPages['book']=bookNamesList
bookPages['genre']=genreList
bookPages['author']=authorNamesList
bookPages['review']=reviewList

bookPages

,book,genre,author,review
0,The Wish,Fiction / Popular Fiction,Nicholas Sparks,Being a titan in romantic fiction comes with s...
1,From the Tops of the Trees,Children's / Picture Book,"Kao Kalia Yang, Rachel Wada",With realism and a strong thread of empowermen...
2,Vespertine,YA / YA Fiction,Margaret Rogerson,"In Loraille, the Dead are dangerous. If they’r..."
3,The Afrominimalist’s Guide to Living With Less,Audio / Nonfiction / Lifestyles,"Christine Platt, Cast",If you think minimalism is a one-size-fits-all...
4,★ The Right to Sex,Nonfiction / Social Science,Amia Srinivasan,"In The Right to Sex, Amia Srinivasan, a profes..."

### Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.

In [48]:
MensTop10ODI=requests.get("https://www.icc-cricket.com/rankings/mens/team-rankings/odi")
MensTop10ODISoup=BeautifulSoup(MensTop10ODI.content)

In [49]:
teams=MensTop10ODISoup.find_all('span',class_='u-hide-phablet')
teams=teams[0:10]
teamlist=[]
for team in teams:
    teamlist.append(team.text)

matches_points=MensTop10ODISoup.find_all('td',class_=['rankings-block__banner--matches','rankings-block__banner--points','table-body__cell u-center-text'])
matches_points = matches_points[0:20]
matches = matches_points[0:20:2]
points = matches_points[1:20:2]
matches_list=[]
for match in matches:
    matches_list.append(match.text)
points_list=[]
for point in points:
    points_list.append(point.text)
rankings=MensTop10ODISoup.find_all('td',class_=['rankings-block__banner--rating u-text-right','table-body__cell u-text-right rating'])
rankings=rankings[0:10]
rankings_list=[]
for ranking in rankings:
    rankings_list.append(ranking.text.strip())

In [50]:
top10MensODI=pd.DataFrame({})
top10MensODI['team']=teamlist
top10MensODI['matches']=matches_list
top10MensODI['points']=points_list
top10MensODI['rank']=rankings_list
top10MensODI['index']=list(range(1,11))
top10MensODI.set_index('index',inplace=True)
top10MensODI

               team matches points rank
index
1       New Zealand      17  2,054  121
2           England      32  3,793  119
3         Australia      28  3,244  116
4             India      32  3,624  113
5      South Africa      25  2,459   98
6          Pakistan      27  2,524   93
7        Bangladesh      30  2,740   91
8       West Indies      30  2,523   84
9         Sri Lanka      32  2,657   83
10      Afghanistan      17  1,054   62

### Top 10 ODI Batsmen in men along with the records of their team and rating.

In [51]:
MensTop10ODIBatsMen=requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting")
MensTop10ODIBatsMenSoup=BeautifulSoup(MensTop10ODIBatsMen.content)

In [52]:
names=MensTop10ODIBatsMenSoup.find_all(class_=['rankings-block__banner--name-large','table-body__cell rankings-table__name name'])
names=names[0:10]

ratings=MensTop10ODIBatsMenSoup.find_all(class_=['rankings-block__banner--rating','table-body__cell rating'])
ratings=ratings[0:10]


teams=MensTop10ODIBatsMenSoup.find_all(class_=['rankings-block__banner--nationality','table-body__logo-text'])
teams=teams[0:10]

In [53]:
namelist=[]
for name in names:
    namelist.append(name.text.strip())

ratingList=[]
for rating in ratings:
    ratingList.append(rating.text.strip())
teamList=[]
for team in teams:
    teamList.append(team.text.strip())

In [54]:
    
top10MensODIBatsmen=pd.DataFrame({})
top10MensODIBatsmen['player']=namelist
top10MensODIBatsmen['team']=teamList
top10MensODIBatsmen['rating']=ratingList
top10MensODIBatsmen['index']=list(range(1,11))
top10MensODIBatsmen.set_index('index',inplace=True)
top10MensODIBatsmen

                player team rating
index
1           Babar Azam  PAK    873
2          Virat Kohli  IND    844
3         Rohit Sharma  IND    813
4          Ross Taylor   NZ    801
5          Aaron Finch  AUS    779
6       Jonny Bairstow  ENG    775
7         David Warner  AUS    762
8            Shai Hope   WI    758
9      Kane Williamson   NZ    754
10     Quinton de Kock   SA    747

### Top 10 ODI bowlers along with the records of their team and rating.

In [55]:
MensTop10ODIBowlers=requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling")
MensTop10ODIBowlersSoup=BeautifulSoup(MensTop10ODIBowlers.content)

In [56]:
names=MensTop10ODIBowlersSoup.find_all(class_=['rankings-block__banner--name-large','table-body__cell rankings-table__name name'])
names=names[0:10]

ratings=MensTop10ODIBowlersSoup.find_all(class_=['rankings-block__banner--rating','table-body__cell rating'])
ratings=ratings[0:10]


teams=MensTop10ODIBatsMenSoup.find_all(class_=['rankings-block__banner--nationality','table-body__logo-text'])
teams=teams[0:10]

In [57]:
namelist=[]
for name in names:
    namelist.append(name.text.strip())

ratingList=[]
for rating in ratings:
    ratingList.append(rating.text.strip())
teamList=[]
for team in teams:
    teamList.append(team.text.strip())

In [58]:
    
top10MensODIBowlers=pd.DataFrame({})
top10MensODIBowlers['player']=namelist
top10MensODIBowlers['team']=teamList
top10MensODIBowlers['rating']=ratingList
top10MensODIBowlers['index']=list(range(1,11))
top10MensODIBowlers.set_index('index',inplace=True)
top10MensODIBowlers

                 player team rating
index
1           Trent Boult  PAK    737
2        Josh Hazlewood  IND    709
3      Mujeeb Ur Rahman  IND    708
4          Chris Woakes   NZ    700
5          Mehedi Hasan  AUS    692
6            Matt Henry  ENG    691
7        Jasprit Bumrah  AUS    679
8        Mitchell Starc   WI    652
9       Shakib Al Hasan   NZ    650
10        Kagiso Rabada   SA    646

### Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [59]:
WomensTop10ODI=requests.get("https://www.icc-cricket.com/rankings/womens/team-rankings/odi")
WomensTop10ODISoup=BeautifulSoup(WomensTop10ODI.content)

In [60]:
teams=WomensTop10ODISoup.find_all('span',class_='u-hide-phablet')
teams=teams[0:10]
teamlist=[]
for team in teams:
    teamlist.append(team.text)

matches_points=WomensTop10ODISoup.find_all('td',class_=['rankings-block__banner--matches','rankings-block__banner--points','table-body__cell u-center-text'])
matches_points = matches_points[0:20]
matches = matches_points[0:20:2]
points = matches_points[1:20:2]
matches_list=[]
for match in matches:
    matches_list.append(match.text)
points_list=[]
for point in points:
    points_list.append(point.text)
rankings=WomensTop10ODISoup.find_all('td',class_=['rankings-block__banner--rating u-text-right','table-body__cell u-text-right rating'])
rankings=rankings[0:10]
rankings_list=[]
for ranking in rankings:
    rankings_list.append(ranking.text.strip())

In [61]:
top10WomensODI=pd.DataFrame({})
top10WomensODI['team']=teamlist
top10WomensODI['matches']=matches_list
top10WomensODI['points']=points_list
top10WomensODI['rank']=rankings_list
top10WomensODI['index']=list(range(1,11))
top10WomensODI.set_index('index',inplace=True)
top10WomensODI

               team matches points rank
index
1         Australia      20  3,304  165
2           England      24  2,840  118
3      South Africa      29  3,390  117
4             India      25  2,735  109
5       New Zealand      25  2,324   93
6       West Indies      22  1,872   85
7          Pakistan      20  1,496   75
8        Bangladesh       5    306   61
9         Sri Lanka      11    519   47
10          Ireland       2     25   13

### Top 10 women’s ODI players along with the records of their team and rating.

In [62]:
WomensTop10ODIBatsMen=requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting")
WomensTop10ODIBatsMenSoup=BeautifulSoup(WomensTop10ODIBatsMen.content)

In [63]:
names=WomensTop10ODIBatsMenSoup.find_all(class_=['rankings-block__banner--name-large','table-body__cell rankings-table__name name'])
names=names[0:11]

ratings=WomensTop10ODIBatsMenSoup.find_all(class_=['rankings-block__banner--rating','table-body__cell rating'])
ratings=ratings[0:11]


teams=WomensTop10ODIBatsMenSoup.find_all(class_=['rankings-block__banner--nationality','table-body__logo-text'])
teams=teams[0:11]

In [64]:
namelist=[]
for name in names:
    namelist.append(name.text.strip())

ratingList=[]
for rating in ratings:
    ratingList.append(rating.text.strip())
teamList=[]
for team in teams:
    teamList.append(team.text.strip())

In [65]:
    
top10WomensODIBatsmen=pd.DataFrame({})
top10WomensODIBatsmen['player']=namelist
top10WomensODIBatsmen['team']=teamList
top10WomensODIBatsmen['rating']=ratingList
top10WomensODIBatsmen['index']=list(range(1,12))
top10WomensODIBatsmen.set_index('index',inplace=True)
top10WomensODIBatsmen

                  player team rating
index
1            Mithali Raj  IND    762
2            Lizelle Lee   SA    761
3           Alyssa Healy  AUS    756
4         Tammy Beaumont  ENG    740
5      Amy Satterthwaite   NZ    726
6            Meg Lanning  AUS    723
7        Smriti Mandhana  IND    701
8           Ellyse Perry  AUS    679
9        Laura Wolvaardt   SA    672
10        Natalie Sciver  ENG    672
11        Heather Knight  ENG    672

### Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [66]:
WomensTop10AllRounderODI=requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder")
WomensTop10AllRounderODISoup=BeautifulSoup(WomensTop10AllRounderODI.content)

In [67]:
names=WomensTop10AllRounderODISoup.find_all(class_=['rankings-block__banner--name-large','table-body__cell rankings-table__name name'])
names=names[0:11]

ratings=WomensTop10AllRounderODISoup.find_all(class_=['rankings-block__banner--rating','table-body__cell rating'])
ratings=ratings[0:11]


teams=WomensTop10AllRounderODISoup.find_all(class_=['rankings-block__banner--nationality','table-body__logo-text'])
teams=teams[0:11]

In [68]:
namelist=[]
for name in names:
    namelist.append(name.text.strip())

ratingList=[]
for rating in ratings:
    ratingList.append(rating.text.strip())
teamList=[]
for team in teams:
    teamList.append(team.text.strip())

In [69]:
    
top10WomensAllRoundersODI=pd.DataFrame({})
top10WomensAllRoundersODI['player']=namelist
top10WomensAllRoundersODI['team']=teamList
top10WomensAllRoundersODI['rating']=ratingList
top10WomensAllRoundersODI['index']=list(range(1,12))
top10WomensAllRoundersODI.set_index('index',inplace=True)
top10WomensAllRoundersODI

                 player team rating
index
1          Ellyse Perry  AUS    418
2        Marizanne Kapp   SA    384
3        Natalie Sciver  ENG    380
4         Deepti Sharma  IND    331
5       Stafanie Taylor   WI    322
6         Jess Jonassen  AUS    307
7      Dane van Niekerk   SA    274
8         Sophie Devine   NZ    254
9       Katherine Brunt  ENG    254
10     Ashleigh Gardner  AUS    252
11      Hayley Matthews   WI    220

###  scraping details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.

In [72]:
def extract_record(item):
    atag=item.h2.a
    prodName=atag.text.strip()
    try:
        price_parent=item.find("span","a-price")
        price=price_parent.find("span","a-offscreen").text
    except AttributeError:
        return
    try:
        rating=item.i.text
    except AttributeError:
        rating=''
    try:
        imgUrl=item.img['src']
    except AttributeError:
        imgUrl = ''
    result = (prodName,price,rating,imgUrl)
        
    return result

In [73]:
productNameList=[]
priceList=[]
ratingList=[]
imgURLList=[]
page="https://www.amazon.in/s?k=Mobile+phones+under+20000&page={0}&qid=1632554143&ref=sr_pg_{0}"
for i in range(1,10):
    print(page.format(i))
    pageResult=requests.get(page.format(i))
    #print(pageResult)
    if pageResult.status_code==200:
        pageSoup=BeautifulSoup(pageResult.content)
        results=pageSoup.find_all('div',{'data-component-type':"s-search-result"})
        for item in results:
            record=extract_record(item)
            if record:
                a,b,c,d=record
            productNameList.append(a)
            priceList.append(b)
            ratingList.append(c)
            imgURLList.append(d)

https://www.amazon.in/s?k=Mobile+phones+under+20000&page=1&qid=1632554143&ref=sr_pg_1
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=2&qid=1632554143&ref=sr_pg_2
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=3&qid=1632554143&ref=sr_pg_3
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=4&qid=1632554143&ref=sr_pg_4
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=5&qid=1632554143&ref=sr_pg_5
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=6&qid=1632554143&ref=sr_pg_6
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=7&qid=1632554143&ref=sr_pg_7
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=8&qid=1632554143&ref=sr_pg_8
https://www.amazon.in/s?k=Mobile+phones+under+20000&page=9&qid=1632554143&ref=sr_pg_9

In [74]:
Amazon=pd.DataFrame({})
Amazon['product']=productNameList
Amazon['price']=priceList
Amazon['rating']=ratingList

Amazon['imgURL']=imgURLList


Amazon['index']=list(range(1,len(productNameList)+1))
Amazon.set_index('index',inplace=True)
Amazon

,product,price,rating,imgURL
index,,,,
1,"Redmi 9A (Nature Green, 2GB RAM, 32GB Storage)...","₹6,999",4.2 out of 5 stars,https://m.media-amazon.com/images/I/71sxlhYhKW...
2,"Redmi 9 (Sky Blue, 4GB RAM, 64GB Storage) | 2....","₹9,499",4.2 out of 5 stars,https://m.media-amazon.com/images/I/71A9Vo1Bat...
3,"OPPO A31 (Fantasy White, 6GB RAM, 128GB Storag...","₹12,990",4.2 out of 5 stars,https://m.media-amazon.com/images/I/61CnyJ-IbM...
4,"Redmi 9 (Carbon Black, 4GB RAM, 64GB Storage) ...","₹9,499",4.2 out of 5 stars,https://m.media-amazon.com/images/I/716nHhG9SW...
5,"Redmi 9 Power (Mighty Black, 6GB RAM, 128GB St...","₹13,499",4.2 out of 5 stars,https://m.media-amazon.com/images/I/61LHaUOheh...
...,...,...,...,...
60,"Redmi Note 10S (Cosmic Purple, 6GB RAM, 128GB ...","₹16,499",4.1 out of 5 stars,https://m.media-amazon.com/images/I/81sZamLSPW...
61,"Tecno Camon 17 Pro (Arctic Down, 8GB RAM, 128G...","₹16,999",4.0 out of 5 stars,https://m.media-amazon.com/images/I/91Xk9FV1Ed...
62,"Tecno Camon 17 Pro (Arctic Down, 8GB RAM, 128G...","₹16,999",4.0 out of 5 stars,https://m.media-amazon.com/images/I/91Xk9FV1Ed...
63,"Samsung Galaxy M32 (Black, 4GB RAM, 64GB Stora...","₹14,999",4.2 out of 5 stars,https://m.media-amazon.com/images/I/71Q3iSQAwA...
64,"Redmi 9 Prime (Space Blue, 4GB RAM, 64GB Stora...","₹10,499",4.3 out of 5 stars,https://m.media-amazon.com/images/I/71U2SiHgbi...

### extracting information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description.

In [75]:
page=requests.get("https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996")
pageSoup=BeautifulSoup(page.content)

In [76]:
rows=pageSoup.find_all('div',['row row-odd row-forecast','row row-even row-forecast'])
descList=[]
shortDescList=[]
tempList=[]
dayList=[]
for row in rows:
    description=row.find('div','col-sm-10 forecast-text').text.strip()
    descList.append(description)
    CommaSep=description.split(",")[0]
    spaceSep=CommaSep.split(" ")
    shortDesc=(" ").join(spaceSep[-2:])
    shortDescList.append(shortDesc)
    x = re.findall("\d{2}\.", description)
    temp=x[0].strip('.')
    temp=temp+"°F"
    tempList.append(temp)
    day=row.find('div','col-sm-2 forecast-label').text
    dayList.append(day)
        
forecast=pd.DataFrame({})
forecast['day']=dayList
forecast['ShortDesc']=shortDescList
forecast['Temp']=tempList

forecast['description']=descList

forecast['index']=list(range(1,len(dayList)+1))
forecast.set_index('index',inplace=True)
forecast

,day,ShortDesc,Temp,description
index,,,,
1,Today,Mostly cloudy,64°F,"Mostly cloudy, then gradually becoming sunny, ..."
2,Tonight,Mostly cloudy,54°F,"Mostly cloudy, with a low around 54. West wind..."
3,Monday,Mostly cloudy,67°F,"Mostly cloudy, with a high near 67. West wind ..."
4,Monday Night,Mostly cloudy,53°F,A 20 percent chance of rain before 11pm. Most...
5,Tuesday,Sunny,67°F,"Sunny, with a high near 67. West northwest win..."
6,Tuesday Night,Mostly clear,53°F,"Mostly clear, with a low around 53."
7,Wednesday,Sunny,68°F,"Sunny, with a high near 68."
8,Wednesday Night,Mostly clear,54°F,"Mostly clear, with a low around 54."
9,Thursday,Sunny,72°F,"Sunny, with a high near 72."
10,Thursday Night,Mostly clear,55°F,"Mostly clear, with a low around 55."
11,Friday,Sunny,71°F,"Sunny, with a high near 71."
12,Friday Night,Partly cloudy,54°F,"Partly cloudy, with a low around 54."
13,Saturday,Mostly sunny,68°F,"Mostly sunny, with a high near 68."

### fresher job listings from ‘https://internshala.com/’. It should include job title, company name, CTC, and apply date.

In [77]:
page=requests.get("https://internshala.com/fresher-jobs")
soup=BeautifulSoup(page.content)

In [78]:
titles=soup.find_all('div',class_='heading_4_5 profile')
job_titles=[]
for i in titles:
    job_titles.append(i.text.replace("\n",""))
company_names=[]
companies=soup.find_all('a',class_="link_display_like_text")

for i in companies:
    company_names.append(i.text.strip())
otherDetails=soup.find_all('div',class_='internship_other_details_container')
ctcList=[]
datesList=[]
for details in otherDetails:
    ctcList.append(details.select(".item_body")[1].text)
    datesList.append(details.select(".item_body")[2].text)

In [79]:
ctcList=[]
datesList=[]
otherDetails=soup.find_all('div',class_='internship_other_details_container')

for details in otherDetails:
    ctcList.append(details.select(".item_body")[1].text.strip())
    datesList.append(details.select(".item_body")[2].text)

In [80]:
job_titles=[]
company_names=[]
ctcList=[]
datesList=[]

for page in range(1,9):
    home="https://internshala.com/fresher-jobs/page-{}"
    target=home.format(page)
    page=requests.get(target)
    soup=BeautifulSoup(page.content)
    titles=soup.find_all('div',class_='heading_4_5 profile')
    for i in titles:
        job_titles.append(i.text.replace("\n",""))
    companies=soup.find_all('a',class_="link_display_like_text")
    for i in companies:
        company_names.append(i.text.strip())
    otherDetails=soup.find_all('div',class_='internship_other_details_container')
    for details in otherDetails:
        ctcList.append(details.select(".item_body")[1].text.strip())
        datesList.append(details.select(".item_body")[2].text.strip())

In [81]:
    
internshalFreshers=pd.DataFrame({})
internshalFreshers['JobTitle']=job_titles
internshalFreshers['Company']=company_names
internshalFreshers['CTC']=ctcList

internshalFreshers['ApplyByDate']=datesList

internshalFreshers['index']=list(range(1,len(job_titles)+1))
internshalFreshers.set_index('index',inplace=True)
internshalFreshers

,JobTitle,Company,CTC,ApplyByDate
index,,,,
1,Marketing & Sales Executive,Is You Skincare,3 - 4 LPA,25 Oct' 21
2,QA Engineer/Tester,Incrivelsoft Private Limited,3 LPA,25 Oct' 21
3,Software Developer,Magnus Meditourism Private Limited,3 LPA,25 Oct' 21
4,Career Strategist,Ace My Prep,6 LPA,25 Oct' 21
5,Operations Support Staff,Alphamate Technologies,3 LPA,25 Oct' 21
...,...,...,...,...
290,Business Development Associate,XOOG EDLEARN PRIVATE LIMITED,4.5 - 7 LPA,27 Sep' 21
291,Associate (Development),Pratham InfoTech Foundation,3 - 3.5 LPA,29 Sep' 21
292,Firmware Engineer,NBase2 Systems Private Limited,3 LPA,30 Sep' 21
293,Sales Magnet Associate,HyperCAP Private Limited,3 LPA,7 Oct' 21
294,Billing & Accounts Manager,Touchstone Partners,4 - 7 LPA,2 Oct' 21

### house details from https://www.nobroker.in/ for any location. It should include house title, location, area, emi and price

In [82]:
page=requests.get("https://www.nobroker.in/property/sale/hyderabad/Secunderabad?searchParam=W3sibGF0IjoxNy40Mzk5Mjk1LCJsb24iOjc4LjQ5ODI3NDEsInBsYWNlSWQiOiJDaElKS1YwbFNLMkV5enNSTXpTYm1ScUVFQVEiLCJwbGFjZU5hbWUiOiJTZWN1bmRlcmFiYWQifV0=&radius=2.0&type=BHK1&propertyAge=0")                  
pageSoup=BeautifulSoup(page.content)

In [83]:
containers=pageSoup.find_all("div",{'class':'nb__2JHKO'})
len(containers)

10

In [84]:
containers[0].find('div','nb__2CMjv').text

'Annapurna colony'

In [85]:
def get_House(container):
    
    propName=container.find('div','nb__sDz3z').a.text    
    try:
        location=container.find('div','nb__2CMjv').text
    except AttributeError:
        location= " "
    try:
        area=container.find('div',{'class':'nb__3oNyC'}).text
    except AttributeError:
        area=''
    try:
        emi=container.find('div',{'id':"roomType",'class':'font-semi-bold heading-6'}).text
    except AttributeError:
        emi = ''
    try:
        price=container.find('div',{'id':"minDeposit"}).span.text
    except AttributeError:
        price = ''
    result = (propName,location,area,emi,price)
        
    return result

In [86]:
PropList=[]
locList=[]
areaList=[]
EmiList=[]
priceList=[]

for container in containers:
    house=get_House(container)
    prop,loc,area,emi,price=house
    PropList.append(prop)
    locList.append(loc)
    areaList.append(area)
    EmiList.append(emi)
    priceList.append(price)

In [87]:
    
NoBroker=pd.DataFrame({})
NoBroker['Property']=PropList
NoBroker['location']=locList
NoBroker['area']=areaList

NoBroker['EMI']=EmiList

NoBroker['price']=priceList
NoBroker['index']=list(range(1,len(PropList)+1))
NoBroker.set_index('index',inplace=True)
NoBroker

,Property,location,area,EMI,price
index,,,,,
1,"1 BHK Flat For Sale In Pearl Residency, Hyde...",Annapurna colony,486 sqft,"₹14,328/Month",₹25 Lacs
2,1 BHK Apartment For Sale In Saket Pranaam In...,"Saket Pranaam Kapra - Saket Road, Saket, A. ...",702 sqft,"₹24,072/Month",₹42 Lacs
3,1 BHK Flat For Sale In Rajsukh Apartments In...,malkajgiri,550 sqft,"₹9,743/Month",₹17 Lacs
4,1 BHK Flat For Sale In Manjuroopa Apartment ...,E Anandbagh Main Rd near Venkateshwara Swamy T...,350 sqft,"₹6,476/Month",₹11.3 Lacs
5,1 BHK Flat For Sale In Sri Sai Constructions...,Seetha Ram Nagar.Near JJ Talent School.Safilgu...,460 sqft,"₹10,889/Month",₹19 Lacs
6,1 BHK In Independent House For Sale In Keesara,"Independent House, ECIL, near Asian Radhika Mu...",900 sqft,"₹39,546/Month",₹69 Lacs
7,1 BHK In Independent House For Sale In Malka...,"Independent House, Yadav Nagar near Adarsh Fil...",450 sqft,"₹20,060/Month",₹35 Lacs
8,1 BHK Flat For Sale In Bhavani Enclave In Da...,"Nagaram Rd,",563 sqft,"₹14,328/Month",₹25 Lacs
9,1 BHK In Independent House For Sale In Cherl...,"Independent House, Cherlapalli near Silver Oa...",800 sqft,"₹19,486/Month",₹34 Lacs
10,1 BHK Flat For Sale In Shiva Divya Residency...,Risala bazar,700 sqft,"₹8,597/Month",₹15 Lacs